# Προσθήκη δύο αριθμών (70 + 37)

.data

.text
.globl main

main:

	li $t0, 70               # Άμεση φόρτωση στο καταχωρητή $t0 το 70
    li $t1, 37               # Άμεση φόρτωση στο καταχωρητή $t1 το 37

    add $t0 $t0, $t1         # Προσθήκη στο $t0 = $t0 + $t1

    li $v0, 1                # Άμεση φόρτωση στο καταχωρητή $v0 την τιμή 1 (syscall για print_int)
    move $a0, $t0            # Φόρτωση στο καταχωρητή $a0 το περιεχόμενο του $t0
    syscall                  # Κλήση syscall

    li  $v0, 10 			 # Άμεση φόρτωση στο καταχωρητή $v0 την τιμή 10 (syscall για exit)
	syscall	 				 # Κλήση syscall