	.data
		msg1: .asciiz "\n"
		
	.text						# Μέρος text προγράμματος
	.globl main					# Κύριο πρόγραμμα

main:
	addi $t0, $t0, 1			# Αρχικοποίηση i (:t0) με 1		
	addi $s1, $s1, 0			# Αρχικοποίηση s1 με 0	

	for:						# Ετικέτα for:	
		slti $t1, $t0, 11		# Το $t1 τίθεται ίσος µε 1 αν η τιµή στον  καταχωρητή $t0 είναι µικρότερη από την τιµή 11, αλλιώς ο καταχωρητής $t1 τίθεται ίσος µε 0

		beq $t1, $s1, else		# Aν τιμή του καταχ. $t1 ίση με την τιμή του καταχ. $s1, πήγαινε στην ετικέτα else
		
		li $v0, 1	  			# Άμεση φόρτωση στο καταχωρητή $v0 την τιμή 1 (syscall για print_int)	
		move $a0, $t0			# Φόρτωση στο καταχωρητή $a0 το περιεχόμενο του $t3
		syscall  
		
		li $v0, 4   			# Άμεση φόρτωση στο καταχωρητή $v0 την τιμή 4 (syscall για print_string) = \n
		la $a0, msg1  			# Φόρτωση της διέυθυνσης του msg1 στο καταχωρητή $a0 (argument to print_string call)
		syscall  				# Κλήση syscall
   
		addi $t0, $t0, 1 		# Αυξάνουμε το μετρητή της for (:i=i+1)
	j for						# Μεταπήδηση στην ετικέτα for (δημιουργία επαναληπτικού βρόγχου)
	
	else:						# Ετικέτα else
	li  $v0, 10 				# Άμεση φόρτωση στο καταχωρητή $v0 την τιμή 10 (syscall για exit)
	syscall	 					# Κλήση syscall