;∆ιαδικασία-φύλλο (leaf)
;int leaf_example
;(int g, int h, int i, int j)
;{int f;
;f = (g + h) – (i + j);  
;return f;}
;Ορίσµατα g, …, j στους $a0, …, $a3
;f στον $s0
;Αποτέλεσµα στον $v0

leaf_example:            ;ετικέτα διαδικασίας  
    addi $sp,$sp,-12     ;χώρος στη στοίβα για 3 αντικείµενα
    sw $t1, 8($sp)           ;αποθήκευση $t1  
    sw $t0, 4($sp)           ;αποθήκευση $t0  
    sw $s0, 0($sp)           ;αποθήκευση $s0

;Το πέρασµα των παραµέτρων της συνάρτησης
;g,h,i,j γίνεται µέσω των $a0,$a1,$a2,$a3
;Για να επιστρέψουµε το αποτέλεσµα της f($s0),
;το αντιγράφουµε στον καταχωρητή $v0

    add $t0, $a0, $a1   ;$t0 περιέχει g+h   
    add $t1, $a2, $a3   ;$t1 περιέχει i+j   
    sub $s0, $t0, $t1   ;f = $t0–$t1
    add $v0, $s0, $zero ;επιστρέφει το f($v0=$s0+0)

;Επαναφέρουµε τις παλιές τιµές των καταχωρητών  από τη στοίβα
;Η διαδικασία ολοκληρώνεται µε µια εντολή jump  register

    lw $s0, 0($sp)     ;επαναφορά $s0
    lw $t0, 4($sp)     ;επαναφορά $t0
    lw $t1, 8($sp)     ;επαναφορά $t1

    addi $sp, $sp,12   ;ρύθµιση στοίβας
    jr	$ra            ;επιστροφή στην καλούσα ρουτίνα



