;Procedure call: εντολή άλµατος και σύνδεσης
;(jump-and-link instruction)
;jal ∆ιεύθυνση ∆ιαδικασίας
;Μεταφέρεται σε µια διεύθυνση και
;Αποθηκεύει τη διεύθυνση της επόµενης εντολής σε έναν καταχωρητή
;Αποθηκεύει τον PC + 4 στον $ra
;Μετρητής προγράµµατος (program counter - PC)
;Καταχωρητής που περιέχει τη διεύθυνση της εκτελούµενης εντολής
;∆ιεύθυνση επιστροφής (return address - RA)
;Επιτρέπει σε µια διαδικασία να επιστρέψει στην κατάλληλη διεύθυνση
;Procedure return: jump register (jr):
;jr $ra
;Άλµα χωρίς συνθήκη στη διεύθυνση που καθορίζεται σε έναν καταχωρητή
